"""
###
__คำสั่ง if ที่ซ้อนกัน__
คำสั่ง if ก็เป็นรูปแบบหนึ่งของคำสั่งเช่นกัน
ดังนั้นบล็อคที่สามารถใส่คำสั่งอะไรก็ได้ ก็ย่อมจะมีคำสั่ง if
อยู่ในนั้นได้ด้วยเช่นกัน
เรียกว่าคำสั่งเงื่อนไขซ้อนกัน ( nested if )
###
"""

"""
## ตัวอย่าง: ผลการสอบ (if) ##
คุณได้รับคะแนนการสอบ
ถ้าคะแนนมากกว่า 8 จะถือว่าได้คะแนนดี
ถ้าคะแนนมากกว่า 4 แต่น้อยกว่าเท่ากับ 8 คุณจะสอบผ่าน
ถ้าคะแนนน้อยกว่าหรือเท่ากับ 4, ถือว่าสอบตก
"""
score = int(input("input Your Score: "))

if score > 8:
    print("Good")
if score > 4 and score <= 8:
    print("Passed")
if score <= 4:
    print("Failed")