"""
เขียนโปรแกรมที่ให้ผู้ใช้ป้อนรหัสผ่าน จนกระทั่งผู้ใช้ป้อนรหัสผ่านที่ถูกต้อง
ให้ใช้รหัสผ่านเป็น 'happy204111'.
##
    ตอบคำถามต่อไปนี้:
    เงื่อนไขใดที่ทำให้โปรแกรมยังทำงานซ้ำ ๆ อยู่?
    ในแต่ละรอบคุณต้องการทำอะไร?
    คุณต้องทำอะไร ก่อนที่จะสามารถตรวจสอบเงื่อนไขในครั้งแรกได้?
## 
pwd = input("Enter password: ")

while ______________________:

    ____________________

    ____________________

print("Correct.")
##
"""
pwd = str(input("Enter password: "))
while pwd !="happy204111":
    print("Sorry")
    pwd = str(input("Enter password: "))
print("Correct")

