"""
ร้านขายลูกอมร้านหนึ่ง มีเงื่อนไขในการขายว่าในการซื้อลูกอมครั้งหนึ่ง ๆ จะต้องซื้อลูกอมอย่างน้อย s ลูก
ให้ตัวแปร x แทนจำนวนลูกอมที่ต้องการซื้อ  เขียนโปรแกรมที่ปรับค่าตัวแปร x ให้เท่ากับจำนวนลูกอมที่คุณต้องซื้อ ตัวอย่างเช่น
ถ้า s = 5 และ x = 7 เมื่อโปรแกรมทำงานแล้ว จะได้ x = 7
ถ้า s = 10 และ x = 5 เมื่อโปรแกรมทำงานแล้ว จะได้ x = 10

if x < s:
    x = s
"""

def num_candies(want, limit):
    if want < limit:
        return limit
    return want

limit = 20
x = int(input("How many?"))
print("You should buy",
      num_candies(x,limit),
      "candies.")