"""
เขียนโปรแกรมเพื่อคำนวณเวลาในการเติมน้ำลงถังทรงกระบอกที่ว่าง
เปล่า โดยถามข้อมูลผู้ใช้ดังนี้

- เส้นผ่านศูนย์กลางของภังเป็นนิ้ว
- ความสูงของถัง เป็นนิ้ว
- อัตราการไหลของน้ำ เป็น ซีซีต่อวินาที (1 ซีซี |ลูกบาศก์เซนติเมตร)

จากนั้นแสดงเวลาในการเติมน้ำให้เต็มถัง เป็นหน่วย "นาที"

 Time = Volume / flow rate  (เวลาเต็มถัง = ปริมาตรถัง / อัตราการไหล)

"""
import math
d=float(input("กรุณากรอก เส้นผ่านศูนย์กลาง(inch):"))
h=float(input("กรุณากรอกความสูง (inch): "))
fr=float(input("กรุณากรอกอัตตราการไหลของน้ำ (cc/second): "))

# รับมาเป็นนิ้ว แปลงเป็น เซน เพื่อให้ง่ายต่อการคำนวณ
d = d*2.54
h = h*2.54
r=d/2 #redius
print("---------------")
print("เส้นผ่านศูนย์กลาง",d,"เซนติเมตร")
print("ความสูง ",h," เซนติเมตร")
print("รัศมี ",r," เซนติเมตร ")
#ตอนนี้ เป็น เซนติเมตร

def volume(r,h):
    v = math.pi*r*r*h
    return v

volume=volume(r,h)
print("ปริมาตรของถัง",volume,"ลูกบาศก์เซนติเมตร")
print("อัตราการไหลของน้ำ",fr,"ตลูกบาศก์เซนติเมตร ต่อ วินาที")
time = volume/fr # เวลาที่ใช้ ปริมาตร ต่อ วินาที
print("---------------")
print("ใช้เวลา : ",time,"วินาที น้ำจึงจะเต็มถัง")
time = time/60 # เวลาที่ใช้ ต่อ นาที
print("---------------")
print("ใช้เวลา : ",time,"นาที น้ำจึงจะเต็มถัง")
